mikaelpatel/Cosa-Pinoccio/boards.txt
# @file boards.txt
# @version 1.0
#
# @section License
# Copyright (C) 2015, Mikael Patel
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
# Lesser General Public License for more details.
#
# @section Description
# The Cosa Pinoccio Scout core boards definition file.
#
# This file is part of the Arduino Che Cosa project.

##
# PINOCCIO BOARDS
##

# AVR:Pinoccio
# Ext Crystal Osc.>8 MHz; Start-up time PWRDWN/RESET: 16K CK + 65 ms
# Brown-out detection level 2.7 V. Serial program downloading enabled
# Boot Reset vector enable (4096 words, 0x1f000).
pinoccio.name=Cosa Pinoccio Scout (ATmega256RFR2/STK500v2)
pinoccio.upload.tool=avrdude
pinoccio.upload.protocol=wiring
pinoccio.upload.maximum_size=253952
pinoccio.upload.maximum_data_size=32768
pinoccio.upload.maximum_eeprom_size=8192
pinoccio.upload.speed=115200

pinoccio.bootloader.tool=avrdude
pinoccio.bootloader.low_fuses=0xff
pinoccio.bootloader.high_fuses=0xd0
pinoccio.bootloader.extended_fuses=0xfe

pinoccio.build.mcu=atmega256rfr2
pinoccio.build.f_cpu=16000000L
pinoccio.build.board=PINOCCIO_SCOUT
pinoccio.build.variant=pinoccio/scout
pinoccio.build.core=Cosa:cosa

